readme.org
#+TITLE: Paper draft to publish cp_measure-related work
#+OPTIONS: ^:nil

*** Repo contents:
- draft.org: main draft of the paper
- bib file with citations
- Some sty files required by CodeML
- gen_pdf.org: Org mode file that allows for deterimnistic generation of the pdf using the makefile
- Makefile: Automates generation and update of the PDF.

**** For reproducibility:
  - flake.{nix,lock}: Contains emacs and uv dependencies for Python figure generation and emacs-based org->tex->PDF
  - =src=: code content. If applicable dependencies will be inside folders within a pyproject.toml or in the header of a script to be run with =uv run --script= 
